Repository: code-dot-org/curriculumbuilder
Catalog: i18n/static/translations/*/LC_MESSAGES/django.po
Languages: ar_sa, es_es, fr_fr, hi_in, it_it, pl_pl, pt_br, uz_uz

source: Lesson %(lesson_number)s
ar_sa: الدرس %(lesson_number)s
es_es: Lección %(lesson_number)s
fr_fr: Leçon %(lesson_number)s
hi_in: पाठ %(lesson_number)s
it_it: Lezione %(lesson_number)s
pl_pl: Lekcja %(lesson_number)s
pt_br: Lição %(lesson_number)s
uz_uz: %(lesson_number)s-dars

source: Teaching Guide
ar_sa: دليل التدريس
es_es: Guía docente
fr_fr: Guide d'Enseignement
hi_in: अध्यापन गाइड
it_it: Guida didattica
pl_pl: Poradnik dydaktyczny
pt_br: Guia de Ensino
uz_uz: O‘qituvchi uchun yo‘riqnoma

source: Standards Alignment
ar_sa: توافق المعايير
es_es: Normas de aprendizaje
fr_fr: Harmonisation des Normes
hi_in: मानक संरेखण
it_it: Mappatura delle competenze
pl_pl: Dostosowanie standardów
pt_br: Adesão a Normas
uz_uz: Standartlarga mosligi

source: View full course alignment
ar_sa: عرض توافق الدورة الكاملة
es_es: Ver las normas del curso
fr_fr: Afficher l'alignement complet du cours
hi_in: पूर्ण पाठ्यक्रम संरेखण देखें
it_it: Visualizza la mappatura completa del corso
pl_pl: Zobacz pełne dostosowanie kursu
pt_br: Ver adesão completa do curso
uz_uz: Kursning to‘liq mosligini ko‘ring

source: Cross-curricular Opportunities
ar_sa: فرص عبر المناهج الدراسية
es_es: Oportunidades multidisciplinarias
fr_fr: Opportunités Pluridisciplinaires
hi_in: पार-पाठिक अवसर
it_it: Competenze interdisciplinari
pl_pl: Możliwości międzyprzedmiotowe
pt_br: Oportunidades Interdisciplinares
uz_uz: Kurslararo imkoniyatlar

source: This list represents opportunities in this lesson to support standards in other content areas.
ar_sa: تمثل هذه القائمة فرصًا في هذا الدرس لدعم المعايير في مجالات المحتوى الأخرى.
es_es: Esta lista presenta oportunidades dentro de la lección para acompañar las normas de otras áreas de contenido.
fr_fr: Cette liste représente des possibilités dans cette leçon pour soutenir les normes dans d'autres domaines de contenu.
hi_in: यह सूची अन्य सामग्री क्षेत्रों में मानकों का समर्थन करने के लिए इस पाठ में अवसरों का प्रतिनिधित्व करती है।
it_it: Questo elenco riporta le competenze di altre materie sulle quali gli alunni hanno l'opportunità di esercitarsi in questa lezione.
pl_pl: Ta lista przedstawia w tej lekcji możliwości wspierania standardów w innych obszarach treści.
pt_br: Esta lista representa as oportunidades desta lição para apoiar as normas em outras áreas de conteúdo.
uz_uz: Ushbu ro‘yxat darsning boshqa sohalaridagi standartlarni qo‘llab-quvvatlash imkoniyatlarini aks ettiradi.

source: Units
ar_sa: وحدات
es_es: Unidades
fr_fr: Unités
hi_in: इकाइयों
it_it: Unità
pl_pl: Jednostki
pt_br: Unidades
uz_uz: Dars birliklari

source: more
ar_sa: المزيد
es_es: más
fr_fr: plus
hi_in: अधिक
it_it: altro
pl_pl: więcej
pt_br: mais
uz_uz: ko‘proq

source: Standards
ar_sa: معايير
es_es: Normas
fr_fr: Normes
hi_in: मानक
it_it: Competenze
pl_pl: Standardy
pt_br: Normas
uz_uz: Standartlar

source: Vocab
ar_sa: مفردات
hi_in: शब्दावली
it_it: Glossario
pl_pl: Słownictwo
pt_br: Vocabulário
uz_uz: Lug‘at

source: Code Documentation
ar_sa: توثيق التعليمات البرمجية
es_es: Documentación de código
fr_fr: Documentation du Code
hi_in: कोड का दस्तावेजीकरण
it_it: Indice
pl_pl: Dokumentacja kodu
pt_br: Documentação do Código
uz_uz: Kod dokumentatsiyasi

source: Other Resources
ar_sa: مصادر أخرى
es_es: Otros recursos
fr_fr: Autres Ressources
hi_in: अन्य संसाधन
it_it: Materiali
pl_pl: Inne zasoby
pt_br: Outros Recursos
uz_uz: Boshqa resurslar

source: Last updated
ar_sa: آخر تحديث
es_es: Última actualización
fr_fr: Dernière mise à jour
hi_in: पिछली बार अद्यतन किया
it_it: Ultimo aggiornamento
pl_pl: Ostatnia aktualizacja
pt_br: Última atualização
uz_uz: So‘nggi yangilangan

source: If you are interested in licensing Code.org materials for commercial purposes, [contact us](//code.org/contact).
ar_sa: إذا كنت مهتماً بالحصول على مواد Code.org المرخصة لأغراض تجارية، تفضل بالاتصال [اتصل بنا](//code.org/contact).
es_es: [Contáctanos](//code.org/contact) si estás interesado en contar con la licencia de los materiales de Code.org para uso comercial.
fr_fr: Si vous êtes intéressé par l’octroi de licences aux matériaux de Code.org à des fins commerciales, contactez-nous (// code.org/contact).
hi_in: यदि आप व्यावसायिक उद्देश्यों के लिए लाइसेंस वाली Code.org सामग्रियों में रुचि रखते हैं, [हमें संपर्क करें](//code.org/contact)।
it_it: Se siete interessati ad utilizzare i materiali di Code.org per scopi commerciali, [contattateci](//code.org/contact).
pl_pl: Jeżeli jesteś zainteresowany uzyskaniem licencji na materiały ze strony Code.org dla celów komercyjnych, [skontaktuj się z nami](//code.org/contact).
pt_br: Se você tiver interesse em materiais do Code.org para fins comerciais, [contact us](//code.org/contact).
uz_uz: Agar siz bizning materiallarimizni tijorat maqsadlarida litsenziyalashga qiziqsangiz, biz bilan [bog‘laning](//code.org/contact).

source: Optional Lesson: %(lesson_title)s
ar_sa: درس اختياري: %(lesson_title)s
es_es: Lección Opcional: %(lesson_title)s
fr_fr: Leçon Facultative: %(lesson_title)s
it_it: Lezione facoltativa: %(lesson_title)s
pl_pl: Opcjonalna lekcja: %(lesson_title)s
pt_br: Lição opcional: %(lesson_title)s
uz_uz: Majburiy bo‘lmagan dars: %(lesson_title)s

source: Lesson %(lesson_number)s: %(lesson_title)s
ar_sa: الدرس %(lesson_number)s: %(lesson_title)s
es_es: Lección %(lesson_number)s: (%(lesson_title)s)
fr_fr: Leçon %(lesson_number)s : %(lesson_title)s
hi_in: पाठ %(lesson_number)s: %(lesson_title)s
it_it: Lezione %(lesson_number)s: %(lesson_title)s
pl_pl: Lekcja %(lesson_number)s: %(lesson_title)s
pt_br: Lição %(lesson_number)s: %(lesson_title)s
uz_uz: Dars %(lesson_number)s: %(lesson_title)s

source: Overview
ar_sa: نظرة عامة
es_es: Descripción
fr_fr: Aperçu
hi_in: रूप-रेखा
it_it: Panoramica
pl_pl: Przegląd
pt_br: Visão Geral
uz_uz: Umumiy ma’lumot.

source: Purpose
ar_sa: الغاية
es_es: Objetivo
fr_fr: But
hi_in: उद्देश्य
it_it: Traguardo di apprendimento
pl_pl: Cel
pt_br: Propósito
uz_uz: Maqsad

source: Agenda
ar_sa: جدول أعمال
fr_fr: Calendrier
hi_in: एजेंडा
it_it: Pianificazione
uz_uz: Reja

source: Objectives
ar_sa: الأهداف
es_es: Objetivos
fr_fr: Objectifs
hi_in: लक्ष्य
it_it: Obiettivi
pl_pl: Cele
pt_br: Objetivos
uz_uz: Vazifalar

source: Students will be able to:
ar_sa: سيتمكن الطلاب من:
es_es: El alumnado podrá:
fr_fr: Les étudiants seront en mesure de :
hi_in: छात्र इस योग्य होंगे:
it_it: Gli alunni saranno in grado di:
pl_pl: Uczniowie będą w stanie:
pt_br: Os estudantes serão capazes de:
uz_uz: Talabalar quyidagilarni o‘rganadi:

source: Preparation
ar_sa: الإعداد
es_es: Preparación
fr_fr: Préparation
hi_in: तैयारी
it_it: Preparazione
pl_pl: Przygotowanie
pt_br: Preparação
uz_uz: Tayyorlanish

source: Links
ar_sa: الروابط
es_es: Enlaces
fr_fr: Liens
hi_in: लिंक
it_it: Collegamenti
pl_pl: Odnośniki
uz_uz: Havolalar

source: Heads Up!
ar_sa: انتباه!
es_es: Aviso!
fr_fr: Votre Attention !
it_it: Attenzione!
pl_pl: Uwaga!
pt_br: Aviso!
uz_uz: Ruhingizni tushirmang!

source: Please make a copy of any documents you plan to share with students.
ar_sa: يرجى عمل نسخة من أي مستندات تخطط لمشاركتها مع الطلاب.
es_es: Por favor realice una copia de los documentos que piense compartir con los estudiantes
fr_fr: Veuillez faire une copie de tout document que vous envisagez de partager avec les élèves.
it_it: Fai una copia di tutti i documenti che intendi condividere con gli studenti.
pl_pl: Zrób kopię wszelkich dokumentów, które planujesz udostępnić uczniom.
pt_br: Faça uma cópia dos documentos que você planeja compartilhar com os estudantes.
uz_uz: Iltimos, talabalarga tarqatishni rejalashtirgan har qanday hujjatdan nusxa oling.

source: For the %(group)s
ar_sa: من أجل %(group)s
es_es: Para %(group)s
fr_fr: Pour le %(group)s
it_it: Per %(group)s
pl_pl: Dla %(group)s
pt_br: Para %(group)s
uz_uz: %(group)s guruhlar uchun

source: Make a Copy
ar_sa: عمل نسخة
es_es: Hacer una copia
fr_fr: Faire une copie
hi_in: एक प्रति बनाएं
it_it: Crea una copia
pl_pl: Utwórz kopię
pt_br: Fazer uma Cópia
uz_uz: Nusxa olish

source: PDF
ar_sa: بي دي إف

source: Google Docs
ar_sa: مستندات Google
it_it: Documenti Google
pl_pl: Dokumenty Google

source: Add a resource
ar_sa: إضافة مصدر
es_es: Agrega un recurso
fr_fr: Ajouter une ressource
it_it: Aggiungi una risorsa
pl_pl: Dodaj zasób
pt_br: Adicionar um recurso
uz_uz: Resurs qo‘shish

source: Vocabulary
ar_sa: مفردات
es_es: Vocabulario
fr_fr: Vocabulaire
hi_in: शब्दावली
it_it: Glossario
pl_pl: Słownictwo
pt_br: Vocabulário
uz_uz: Lug‘at

source: Introduced Code
ar_sa: التعليمة البرمجية المعروضة
es_es: Código presentado
fr_fr: Code Introduit
hi_in: पेश किया गया कोड
it_it: Codice introdotto
pl_pl: Wprowadzony kod
pt_br: Código Introduzido
uz_uz: Tanishtirilgan kod

source: Support
ar_sa: الدعم
es_es: Soporte
fr_fr: Soutien
hi_in: सहयोग
it_it: Supporto
pl_pl: Wsparcie
pt_br: Suporte
uz_uz: Qo‘llab-quvvatlash

source: Lesson Forum
ar_sa: منتدى الدرس
es_es: Foro de la lección
fr_fr: Leçon Forum
it_it: Forum della lezione
pl_pl: Forum lekcji
pt_br: Fórum da Lição
uz_uz: Dars muhokamasi

source: Report a Bug
ar_sa: الإبلاغ عن خطأ
es_es: Informar un error
fr_fr: Signaler un Bug
hi_in: बग की रिपोर्ट करें
it_it: Segnala un errore
pl_pl: Zgłoś błąd
pt_br: Relatar um Bug
uz_uz: Xato haqida xabar berish

source: Give us feedback!
ar_sa: أخبرنا بملاحظاتك!
es_es: ¡Danos tu opinión!
fr_fr: Donnez-nous votre avis !
hi_in: हमें प्रतिक्रिया दें!
it_it: Lascia un commento!
pl_pl: Prześlij nam swoją opinię
pt_br: Diga-nos sua opinião!
uz_uz: Bizga fikringizni bildiring!

source: Lesson
ar_sa: الدرس
es_es: Lección
fr_fr: Leçon
hi_in: पाठ
it_it: Lezione
pl_pl: Lekcja
pt_br: Lição
uz_uz: Dars

source: Assessment Opportunities
ar_sa: فرص التقييم
es_es: Oportunidades de evaluación
fr_fr: Opportunités d'Évaluation
hi_in: मूल्यांकन के अवसर
it_it: Possibilità di valutazione
pl_pl: Możliwości oceny
pt_br: Oportunidades de Avaliação
uz_uz: Baholash imkoniyatlari

source: View on Code Studio
ar_sa: عرض في Code Studio
es_es: Ver en Code Studio
fr_fr: Afficher sur Code Studio
hi_in: कोड स्टूडियो पर देखें
it_it: Visualizza in Code Studio
pl_pl: Zobacz na Code Studio
pt_br: Exibir no Code Studio
uz_uz: Code Studioda ko‘rish

source: Anchor Standards
ar_sa: معايير الارتكاز
es_es: Normas generales
hi_in: एंकर के मानक
it_it: Standard di riferimento
pl_pl: Podstawowe Standardy
pt_br: Normas Estabelecidas
uz_uz: Asosiy standartlar

source: **Heads Up!** Please make a copy of any documents you plan to share with students.
ar_sa: **انتباه!** يرجى عمل نسخة من أي مستندات تخطط لمشاركتها مع الطلاب.
es_es: **¡Importante!** Haz una copia de los documentos que piensas compartir con los estudiantes.
fr_fr: **Votre attention !** Veuillez faire une copie de tout document que vous envisagez de partager avec les élèves.
hi_in: **हेड्स अप!** कृपया किसी भी उन दस्तावेज की एक प्रति बनाएं, जिन्हें आप छात्रों के साथ साझा करने वाले हैं।
it_it: **Attenzione!** Fai una copia di tutti i documenti che intendi condividere con gli alunni.
pl_pl: **Uwaga** Zrób kopię wszelkich dokumentów, które planujesz udostępnić uczniom.
pt_br: **Aviso!** Faça uma cópia dos documentos que você planeja compartilhar com os estudantes.
uz_uz: **Ruhni tushirmang!** Iltimos, talabalarga tarqatishni rejalashtirgan har qanday hujjatdan nusxa oling.

source: For the Students
ar_sa: للطلاب
es_es: Para los estudiantes
fr_fr: Pour les Étudiants
hi_in: छात्रों के लिए
it_it: Per gli alunni
pl_pl: Dla uczniów
pt_br: Para os Estudantes
uz_uz: Talabalar uchun

source: For the Teachers
ar_sa: للمعلمين
es_es: Para los docentes
fr_fr: Pour les Enseignants
hi_in: अध्यापक के लिए
it_it: Per gli insegnanti
pl_pl: Dla nauczycieli
pt_br: Para os Professores
uz_uz: O‘qituvchilar uchun

# .pdf download link
source: PDF
ar_sa: بي دي إف

source: Unit Overview
ar_sa: نظرة عامة على
es_es: Descripción de la unidad
fr_fr: Aperçu de l'unitéToutes
hi_in: इकाई की रूप-रेखा
it_it: Panoramica dell'unità
pl_pl: Omówienie rozdziałów
pt_br: Visão Geral da Unidade
uz_uz: Unit haqida

source: All Lessons PDF
ar_sa: كل الدروس بتنسيق PDF
es_es: Todas las lecciones en PDF
fr_fr: Les leçons PDF
hi_in: सारे पाठ PDF
it_it: Tutte le lezioni in PDF
pl_pl: Wszystkie lekcje PDF
pt_br: Todas as Lições PDF
uz_uz: Darslar (PDF)

source: All Handouts PDF
ar_sa: جميع النشرات بصيغة PDF
es_es: Todas las guías en PDF
fr_fr: Tous les Documents PDF
hi_in: सारे हैंगआउट्स PDF
it_it: Tutte le dispense in PDF
pl_pl: Wszystkie Notatki PDF
pt_br: Todos os Folhetos PDF
uz_uz: Barcha tarqatma materiallar (PDF)

source: Resources
ar_sa: المصادر
es_es: Recursos
fr_fr: Ressources
hi_in: संसाधन
it_it: Materiali
pl_pl: Materiały
pt_br: Recursos
uz_uz: Resurslar

source: Curriculum Overview
ar_sa: نظرة عامة على المنهج
es_es: Descripción del plan de estudios
fr_fr: Aperçu du Programme d'Étude
hi_in: पाठ्यक्रम की रूप-रेखा
it_it: Panoramica del piano di studi
pl_pl: Przegląd programu
pt_br: Visão Geral do Currículo
uz_uz: O‘quv reja haqida

# Vocabulary
source: Vocab
ar_sa: مفردات
hi_in: शब्दावली
it_it: Glossario
pl_pl: Słownictwo
pt_br: Vocabulário
uz_uz: Lug‘at

source: Lessons PDF
ar_sa: الدروس بصيغة PDF
es_es: Lecciones en PDF
fr_fr: PDF des Leçons
hi_in: पाठ PDF
it_it: Lezioni in PDF
pl_pl: Lekcje PDF
pt_br: Lições PDF
uz_uz: Darslar (PDF)

source: Handouts PDF
ar_sa: النشرات بصيغة PDF
es_es: Guías en PDF
fr_fr: PDF des Documents
hi_in: हैंगआउट्स PDF
it_it: Dispense in PDF
pl_pl: Notatki PDF
pt_br: Folhetos PDF
uz_uz: Tarqatma materiallar (PDF)

source: Students Links:
ar_sa: روابط الطلاب:
es_es: Enlaces para estudiantes:
fr_fr: Les Liens des Élèves :
hi_in: छात्र लिंक:
it_it: Collegamenti per gli alunni:
pl_pl: Odnośniki uczniów:
pt_br: Links de Estudante:
uz_uz: Talabalar uchun havolalar:

source: Teacher Links:
ar_sa: روابط المعلم:
es_es: Enlaces para docentes:
fr_fr: Les Liens des Enseignants :
hi_in: शिक्षक लिंक:
it_it: Collegamenti per l'insegnante:
pl_pl: Odnośniki nauczycieli:
pt_br: Links de Professor:
uz_uz: O‘qituvchilar uchun havolalar:

source: Main Curriculum Listing
ar_sa: قائمة المناهج الرئيسية
es_es: Listado principal de planes de estudio
fr_fr: Liste du Programme d'Études Principal
hi_in: मुख्य पाठ्यक्रम की सूची
it_it: Elenco dei piani di studio
pl_pl: Lista głównych programów nauczania
pt_br: Listagem do Currículo Principal
uz_uz: Asosiy o‘quv dasturlar ro‘yxati

source: Concept Maps
ar_sa: خرائط المفاهيم
es_es: Mapas de conceptos
fr_fr: Cartes Conceptuelles
hi_in: धारणा मानचित्र
it_it: Mappe concettuali
pl_pl: Mapy koncepcyjne
pt_br: Mapas Conceituais
uz_uz: Konsepsiya xaritalari

source: download
ar_sa: تحميل
es_es: descargar
fr_fr: télécharger
hi_in: डाउनलोड
it_it: scarica
pl_pl: pobierz
pt_br: baixar
uz_uz: yuklab olish

source: Expand All
ar_sa: توسيع الكل
es_es: Desplegar todo
fr_fr: Développer Tous
hi_in: सभी विस्तृत करें
it_it: Espandi tutto
pl_pl: Rozwiń wszystko
pt_br: Expandir Tudo
uz_uz: Barchasini yoyib ochish

source: Collapse All
ar_sa: طي الكل
es_es: Ocultar todo
fr_fr: Effondrer Tous
hi_in: सभी को संक्षिप्त करें
it_it: Comprimi tutto
pl_pl: Zwiń wszystko
pt_br: Recolher Tudo
uz_uz: Barchasini yig‘ib yopish

source: Download as CSV
ar_sa: تنزيل بتنسيق CSV
es_es: Descargar como CSV
fr_fr: Télécharger au format CSV
hi_in: CSV के रूप में डाउनलोड करें
it_it: Scarica in formato CSV
pl_pl: Pobrać jako plik CSV
pt_br: Baixar como CSV
uz_uz: CSV formatda yuklab olish

source: Page not found
ar_sa: الصفحة غير موجودة
es_es: No se encontró la página
fr_fr: Page non trouvée
hi_in: पृष्ठ नहीं मिला
it_it: Pagina non trovata
pl_pl: Nie odnaleziono strony
pt_br: Página não encontrada
uz_uz: Sahifa topilmadi

source: The page you requested does not exist.
ar_sa: الصفحة التي طلبتها غير موجودة.
es_es: La página que solicitaste no existe.
fr_fr: La page que vous avez demandée n’existe pas
hi_in: जिस पृष्ठ का आपने निवेदन किया है, वह मौजूद नहीं है।
it_it: La pagina richiesta non esiste
pl_pl: Strona, której szukasz nie istnieje.
pt_br: A página solicitada não existe.
uz_uz: Siz so‘ragan sahifa mavjud emas

source: Error
ar_sa: خطأ
fr_fr: Erreur
hi_in: त्रुटि
it_it: Errore
pl_pl: Błąd
pt_br: Erro
uz_uz: Xatolik

source: Sorry, an error occurred.
ar_sa: عذرًا، لقد حصل خطأ.
es_es: Lo sentimos, ocurrió un error.
fr_fr: Désolé, une erreur s’est produite
hi_in: अफसोस, एक त्रुटि हुई है।
it_it: Ops, si è verificato un errore.
pl_pl: Przykro nam, wystąpił nieoczekiwany błąd.
pt_br: Desculpe, ocorreu um erro.
uz_uz: Uzr, xatolik ro‘y berdi

source: Microsoft Word
uz_uz: .doc yuklab olish

# .doc download link
source: Microsoft Word
uz_uz: .doc yuklab olish

source: Download standards mapping as CSV
it_it: Scarica la mappatura delle competenze in formato CSV
pl_pl: Pobierz standardy mapowania jako CSV
uz_uz: Standart xaritalashni CSV formatda yuklab oling
